IdeaRS.OpenModel.Detail.PatchDevice
Abstract class of patch support/load

IdeaRS.OpenModel.Detail.PatchDevice.#ctor
Constructor

IdeaRS.OpenModel.Detail.PatchDevice.GeomId
Id representing geometrical parts of Detail

IdeaRS.OpenModel.Detail.PatchDevice.MasterComponent
Master component

IdeaRS.OpenModel.Detail.PatchDevice.MasterPoint
Master point 0 - 9

IdeaRS.OpenModel.Detail.PatchDevice.Position
Offset between MasterPoint and patch support/load